{
    "id": "ivan",
    "name": "Ivan",
    "series": "Alien Stage",
    "mainImage": "https://i.pinimg.com/736x/1b/ef/e1/1befe1790551b1b34361b1268cf51c08.jpg",
    "description": "Ivan (이반) is a complex and enigmatic participant in Alien Stage, known for his exceptional singing talent and deep, one-sided attachment to Till. Despite his outwardly cheerful persona, he harbors a deep sorrow and fatalistic view of the world. His journey from a quiet child in the slums to a polished idol reveals the tragic nature of his character and his ultimate sacrifice for love.",
    "age": "22",
    "birthday": "July 7, 2000",
    "role": "Idol",
    "personality": "Complex & Tragic",
    "analysis": "Ivan's character is a masterful study in contrasts and tragedy. As a child, he was quiet and off-putting due to his slum upbringing, but he developed a deep fascination with Till that would define his entire life. His journey shows a desperate attempt to become \"normal\" - practicing his smile in the Anakt Garden pond and adopting a cheerful persona that made him seem \"too perfect to get close to.\" However, beneath this facade lies a deep sorrow and fatalistic worldview that permeates his songs \"Black Sorrow\" and \"Cure.\" His relationship with Till is the heart of his character - a one-sided love that he seems resigned to, even when they were close to escaping together. His final act in Round 6, where he kisses Till and then appears to choke him, is ambiguous but speaks to his complex nature and ultimate sacrifice.",
    "funFacts": [
        "Birthday: Unknown",
        "Age: Unknown",
        "Role: Contestant performer on Alien Stage: Prologue, known for \"Black Sorrow\" and reaching Top 3",
        "Personality: Not officially documented; fan discussions focus more on visual appeal"
    ],
    "gallery": [
        {
            "url": "https://i.pinimg.com/736x/24/0f/e2/240fe2c42bd974bddf32526f841ede54.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/736x/1b/ef/e1/1befe1790551b1b34361b1268cf51c08.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/736x/c7/56/81/c75681c206e7e91ecbf59b2436c68e10.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/1200x/54/57/83/5457834f1bc6fed45e2d10244e213c8c.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/1200x/94/24/c1/9424c17989da4eefaa4207611d7bbfdc.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/736x/fd/3f/38/fd3f38fd99d75e5658e664234cf4f436.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/736x/73/b3/78/73b3784b07faeac9d89273f9fc82046a.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/736x/6b/01/31/6b0131fc0c42a54024ccf938941f0e77.jpg",
            "alt": "Ivan"
        },
        {
            "url": "https://i.pinimg.com/736x/42/d7/34/42d734e437d2d09c618234404b03d44b.jpg",
            "alt": "Ivan"
        }
    ]
}